{
    "blogs": [
        {
            "id": 0,
            "title": "Creating BrutusMaps",
            "subtitle": "Author's Note",
            "description": "A series of blogs covering the creation of BrutusMaps. A run-through of the process that leads to the website today.",
            "content": [
                "Over time, BrutusMaps went through quite a few iterations. From humble beginnings as a command-line interface, to a Heroku PAAS-model web application, to the fully self-hosted website seen today over at www.brutusmaps.org. Each iteration emerged with an entirely new infrastructure than their predecessors — from programming frameworks to physical hardware.",
                "At the end of each iteration of a project, it's very easy to get caught up in cycles of criticism and doubt. Questions arise: *Could the load time be faster? Could this design be improved? Could this transition be smoother? Could these two components communicate more effectively?* And for every problem solved, two new problems arise.",
                "It's important to realize some of these problems are self-imposed. It's a 21st century issue. When is the work **complete**? For many engineers, **complete** is a set of conditions that may all pass one day and may all fail the next. The conditions are always revolving, trying to align with the expectations of the developer and the audience.",
                "Projects are not destined for perfection. Hell, some projects are lucky if they reach “great”, or even “acceptable.” It's a challenge in itself to not find a weakness in a project, especially if you're the creator. At the end of the day, every project has room for improvement.",
                "This past iteration of BrutusMaps is the result of a project started back in 2020. Four years for a website! You may look at it, and think it could be more complex, show more data, flow better, load faster. And I agree; there's a lot more that could be improved upon.",
                "However, I realized it's time for me to accept this project as it is. I could always implement more features, alter this modal's GUI, speed up or slow down that animation, create an entire caching server to serve map tiles. But if I were striving for perfection, I'd be in an eternal cycle of adding, removing, modifying. The prospect of new, greater, more exciting projects would be left in the dust. (Plus, I'm admittedly pretty happy about this latest iteration.)",
                "This series of blogs is a dive into creating BrutusMaps. Instead of going into very direct details, it aims to be a broader resource of creating a self-hosted web application. Everything from problem identification, project planning, coding, debugging, plan revision, and deployment.",
                "While the blogs are meant to be informative, they also serve as a journal of sorts for me, preserving my growth as a programmer, an engineer, and a creator since I began this project in 2020.",
                "It's a culmination of four years of planning, learning, and creating. I'm glad to be able to share the result and the journey with you."
            ],
            "pubDate": "2024 JAN 20"
        }
    ]
}